base/Catalogs/НастройкиФормированияПроводокМеждународногоУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>НастройкиФормированияПроводокМеждународногоУчета</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ПланыСчетовМеждународногоУчета</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетУчетаДоходов</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Международный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетУчетаРасходов</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Международный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетУчетаНераспределеннойПрибылиУбытка</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Международный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоходыКР</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Международный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяДоходовКР</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СтатьиДоходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасходыКР</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Международный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяРасходовКР</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СтатьиРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоходыОтРазницПриПересчетеВП</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Международный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяДоходовОтРазницПересчета</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СтатьиДоходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасходыОтРазницПриПересчетеВП</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Международный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяРасходовОтРазницПересчета</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СтатьиРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособАннулированияПроводок</Name>
					<Comment>Способ корректировки проводок на уменьшение: сторно или реверсивными проводками</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыАннулированияПроводокМеждународногоУчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьВыделениеДолгосрочныхАктивовОбязательств</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроводкиПоВыручкеБезНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗакрытиеСчетовДоходовИРасходов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЗакрытиеСчетовДоходовИРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СчетаДоходов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Счет</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Международный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СчетаРасходов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Счет</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Международный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СчетаПрибылейУбытков</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Счет</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Международный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИсключитьИзПересчетаВП</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Счет</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Международный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

base/InformationRegisters/ПланыСчетовМеждународногоУчетаОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ПланыСчетовМеждународногоУчетаОрганизаций</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НастройкаФормированияПроводок</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиФормированияПроводокМеждународногоУчета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПланСчетов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПланыСчетовМеждународногоУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

base/AccountingRegisters/Международный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccountingRegister>
		<Properties>
			<Name>Международный</Name>
			<ChartOfAccounts>ChartOfAccounts.Международный</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ПланСчетов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПланыСчетовМеждународногоУчета</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Международный.AccountingFlag.УчетПоПодразделениям</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Международный.AccountingFlag.Валютный</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Международный.AccountingFlag.УчетПоНаправлениямДеятельности</AccountingFlag>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаПредставления</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютнаяСумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Международный.AccountingFlag.Валютный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Международный.ExtDimensionAccountingFlag.Валютный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Международный.AccountingFlag.Количественный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Международный.ExtDimensionAccountingFlag.Количественный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонПроводки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныПроводокДляМеждународногоУчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПроводки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыПроводокМеждународныйУчет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоответствиеСчетаДт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СоответствияСчетовМеждународногоУчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоответствиеСчетаКт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СоответствияСчетовМеждународногоУчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоответствиеОборотов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СоответствияОборотовМеждународногоУчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сторно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторФинЗаписи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаХозяйственнойОперации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиХозяйственныхОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

base/ChartsOfAccounts/Международный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<ChartOfAccounts>
		<Properties>
			<Name>Международный</Name>
			<ExtDimensionTypes>ChartOfCharacteristicTypes.ВидыСубконтоМеждународные</ExtDimensionTypes>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПланСчетов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПланыСчетовМеждународногоУчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеМеждународное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапретитьИспользоватьВПроводках</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Рекласс</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсключитьИзРасчетаКурсовыхРазниц</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодБыстрогоВыбора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<AccountingFlag>
				<Properties>
					<Name>Валютный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</AccountingFlag>
			<AccountingFlag>
				<Properties>
					<Name>УчетПоПодразделениям</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</AccountingFlag>
			<AccountingFlag>
				<Properties>
					<Name>УчетПоНаправлениямДеятельности</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</AccountingFlag>
			<AccountingFlag>
				<Properties>
					<Name>Количественный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</AccountingFlag>
			<ExtDimensionAccountingFlag>
				<Properties>
					<Name>Валютный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</ExtDimensionAccountingFlag>
			<ExtDimensionAccountingFlag>
				<Properties>
					<Name>Количественный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</ExtDimensionAccountingFlag>
		</ChildObjects>
	</ChartOfAccounts>
</MetaDataObject>

base/Catalogs/НастройкиФормированияПроводокМеждународногоУчета/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает настройку формирования проводок, если она для плана счетов одна. Иначе возвращает Неопределено.
// 
// Параметры:
//   ПланСчетов - СправочникСсылка.ПланыСчетовМеждународногоУчета - 
//   
// Возвращаемое значение:
//   СправочникСсылка.НастройкиФормированияПроводокМеждународногоУчета, Неопределено - 
//
Функция НастройкаФормированияПроводокПоУмолчанию(ПланСчетов) Экспорт
	
	Если Не ЗначениеЗаполнено(ПланСчетов) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 2
	|	НастройкиФормированияПроводок.Ссылка
	|ИЗ
	|	Справочник.НастройкиФормированияПроводокМеждународногоУчета КАК НастройкиФормированияПроводок
	|ГДЕ
	|	НастройкиФормированияПроводок.Владелец = &ПланСчетов
	|	И НЕ НастройкиФормированияПроводок.ПометкаУдаления";
	Запрос.УстановитьПараметр("ПланСчетов", ПланСчетов);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Количество = Выборка.Количество();
	
	Если Количество = 0 Тогда
		
		ОсновнаяНастройка = Справочники.НастройкиФормированияПроводокМеждународногоУчета.СоздатьЭлемент();
		ОсновнаяНастройка.Наименование = НСтр("ru = 'Основная';
												|en = 'Main'", ОбщегоНазначения.КодОсновногоЯзыка());
		ОсновнаяНастройка.Владелец = ПланСчетов;
		ОсновнаяНастройка.Заполнить(Неопределено);
		ОсновнаяНастройка.Записать();
		
		Возврат ОсновнаяНастройка.Ссылка;
		
	ИначеЕсли Количество = 1 Тогда
		Выборка.Следующий();
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Неопределено;

КонецФункции // СчетаЗакрытия()

// Структура реквизитов элемента справочника содержащая счета закрытия периода.
// 
// Возвращаемое значение:
//  Структура - в ключах структуры имена реквизитов (табличных частей) счетов закрытия:
// * СчетУчетаДоходов - ПланСчетовСсылка.Международный - 
// * СчетУчетаРасходов - ПланСчетовСсылка.Международный - 
// * СчетУчетаНераспределеннойПрибылиУбытка - ПланСчетовСсылка.Международный - 
// * СчетаДоходов - ТаблицаЗначений - :
// 		** Счет - ПланСчетовСсылка.Международный - 
// * СчетаРасходов - ТаблицаЗначений - :
// 		** Счет - ПланСчетовСсылка.Международный - 
// * СчетаПрибылейУбытков - ТаблицаЗначений - :
// 		** Счет - ПланСчетовСсылка.Международный - 
Функция СчетаЗакрытия() Экспорт

	Результат = Новый Структура;
	
	ПустойСчет = ПланыСчетов.Международный.ПустаяСсылка();
	Результат.Вставить("СчетУчетаДоходов",	ПустойСчет);
	Результат.Вставить("СчетУчетаРасходов", ПустойСчет);
	Результат.Вставить("СчетУчетаНераспределеннойПрибылиУбытка", ПустойСчет);
	
	ПустаяТЗ = Новый ТаблицаЗначений;
	ПустаяТЗ.Колонки.Добавить("Счет", Новый ОписаниеТипов("ПланСчетовСсылка.Международный"));
	Результат.Вставить("СчетаДоходов",	ПустаяТЗ);
	Результат.Вставить("СчетаРасходов",	ПустаяТЗ);
	Результат.Вставить("СчетаПрибылейУбытков",ПустаяТЗ);
	
	Возврат Результат;

КонецФункции // СчетаЗакрытия()

// Структура реквизитов элемента справочника содержащие счета отражения курсовых разниц.
// 
// Возвращаемое значение:
//  Структура - в ключах структуры имена реквизитов (табличных частей) счетов отражения курсовых разниц:
// * ДоходыКР - ПланСчетовСсылка.Международный - 
// * СтатьяДоходовКР - Неопределено, ПланВидовХарактеристикСсылка.СтатьиДоходов - 
// * РасходыКР - ПланСчетовСсылка.Международный - 
// * СтатьяРасходовКР - Неопределено, ПланВидовХарактеристикСсылка.СтатьиРасходов - 
// * ДоходыОтРазницПриПересчетеВП - ПланСчетовСсылка.Международный - 
// * СтатьяДоходовОтРазницПересчета - Неопределено, ПланВидовХарактеристикСсылка.СтатьиДоходов - 
// * РасходыОтРазницПриПересчетеВП - ПланСчетовСсылка.Международный - 
// * СтатьяРасходовОтРазницПересчета - Неопределено, ПланВидовХарактеристикСсылка.СтатьиРасходов - 
// * ИсключитьИзРасчетаКР - ТаблицаЗначений - :
// 		** Счет - ПланСчетовСсылка.Международный - 
// * ИсключитьИзПересчетаВП - ТаблицаЗначений - :
//		** Счет - ПланСчетовСсылка.Международный - 
Функция СчетаКурсовыхРазниц() Экспорт

	Результат = Новый Структура;
	
	ПустойСчет = ПланыСчетов.Международный.ПустаяСсылка();
	Результат.Вставить("ДоходыКР", ПустойСчет);
	Результат.Вставить("СтатьяДоходовКР", Неопределено);
	
	Результат.Вставить("РасходыКР", ПустойСчет);
	Результат.Вставить("СтатьяРасходовКР", Неопределено);
	
	Результат.Вставить("ДоходыОтРазницПриПересчетеВП", ПустойСчет);
	Результат.Вставить("СтатьяДоходовОтРазницПересчета", Неопределено);
	
	Результат.Вставить("РасходыОтРазницПриПересчетеВП", ПустойСчет);
	Результат.Вставить("СтатьяРасходовОтРазницПересчета", Неопределено);
	
	ПустаяТЗ = Новый ТаблицаЗначений;
	ПустаяТЗ.Колонки.Добавить("Счет", Новый ОписаниеТипов("ПланСчетовСсылка.Международный"));
	Результат.Вставить("ИсключитьИзРасчетаКР",	ПустаяТЗ);
	Результат.Вставить("ИсключитьИзПересчетаВП",ПустаяТЗ);
	
	Возврат Результат;

КонецФункции // СчетаКурсовыхРазниц()

// Возвращает таблицу счетов исключения из расчета курсовых разниц.
// 
// Параметры:
//	ПланСчетов - СправочникСсылка.ПланыСчетовМеждународногоУчета - 
//	
// Возвращаемое значение:
//  ТаблицаЗначений - счета учета исключаемые из расчета курсовых разниц:
//  	* Счет - ПланСчетовСсылка.Международный - 
//  	* Исключить - Булево - 
//  	* Порядок - Строка - 
Функция СчетаИсключенияРасчетаКР(ПланСчетов) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Международный.Ссылка КАК Счет,
	|	Международный.ИсключитьИзРасчетаКурсовыхРазниц КАК Исключить,
	|	Международный.Порядок КАК Порядок
	|ИЗ
	|	ПланСчетов.Международный КАК Международный
	|ГДЕ
	|	Международный.ПланСчетов = &ПланСчетов
	|	И Международный.ИсключитьИзРасчетаКурсовыхРазниц = ИСТИНА
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок";
	Запрос.УстановитьПараметр("ПланСчетов", ПланСчетов);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Возвращает таблицу счетов исключения из расчета курсовых разниц.
// 
// Параметры:
//	ПланСчетов - СправочникСсылка.ПланыСчетовМеждународногоУчета - 
//	СчетаИсключения - ТаблицаЗначений - Таблица с колонками:
//		* СчетУчета - ПланСчетовСсылка.Международный - 
//
Процедура ЗаписатьСчетаИсключенияРасчетаКР(ПланСчетов, СчетаИсключения) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СчетаИсключения.Счет КАК Ссылка
	|ПОМЕСТИТЬ СчетаИсключения
	|ИЗ
	|	&СчетаИсключения КАК СчетаИсключения
	|ГДЕ
	|	СчетаИсключения.Исключить
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|ВЫБРАТЬ
	|	Международный.Ссылка КАК Ссылка,
	|	ВЫБОР
	|		КОГДА Международный.ИсключитьИзРасчетаКурсовыхРазниц
	|				И СчетаИсключения.Ссылка ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		КОГДА НЕ Международный.ИсключитьИзРасчетаКурсовыхРазниц
	|				И НЕ СчетаИсключения.Ссылка ЕСТЬ NULL
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ Международный.ИсключитьИзРасчетаКурсовыхРазниц
	|	КОНЕЦ КАК ИсключитьИзРасчетаКурсовыхРазниц
	|ИЗ
	|	ПланСчетов.Международный КАК Международный
	|	ЛЕВОЕ СОЕДИНЕНИЕ 
	|		СчетаИсключения КАК СчетаИсключения
	|	ПО
	|		Международный.Ссылка = СчетаИсключения.Ссылка
	|ГДЕ
	|	ВЫБОР
	|		КОГДА Международный.ИсключитьИзРасчетаКурсовыхРазниц
	|				И СчетаИсключения.Ссылка ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		КОГДА НЕ Международный.ИсключитьИзРасчетаКурсовыхРазниц
	|				И НЕ СчетаИсключения.Ссылка ЕСТЬ NULL
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ Международный.ИсключитьИзРасчетаКурсовыхРазниц
	|	КОНЕЦ <> Международный.ИсключитьИзРасчетаКурсовыхРазниц  
	|	И Международный.ПланСчетов = &ПланСчетов
	|";
	Запрос.УстановитьПараметр("СчетаИсключения", СчетаИсключения);
	Запрос.УстановитьПараметр("ПланСчетов", ПланСчетов);
	Выборка  = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Объект = Выборка.Ссылка.ПолучитьОбъект(); // ПланСчетовОбъект.Международный - 
		Объект.ИсключитьИзРасчетаКурсовыхРазниц = Выборка.ИсключитьИзРасчетаКурсовыхРазниц;
		Объект.Записать();
		
	КонецЦикла
	
КонецПроцедуры

// Возвращает имена блокируемых реквизитов для механизма блокирования реквизитов БСП.
//
// Возвращаемое значение:
//	Массив Из Строка - имена блокируемых реквизитов.
//
Функция ПолучитьБлокируемыеРеквизитыОбъекта() Экспорт
	
	БлокируемыеРеквизиты = Новый Массив;
	БлокируемыеРеквизиты.Добавить("СпособАннулированияПроводок");
	БлокируемыеРеквизиты.Добавить("ИспользоватьВыделениеДолгосрочныхАктивовОбязательств");
	БлокируемыеРеквизиты.Добавить("ПроводкиПоВыручкеБезНДС");
	БлокируемыеРеквизиты.Добавить("ЗакрытиеСчетовДоходовИРасходов");
	
	Возврат БлокируемыеРеквизиты;
	
КонецФункции

#Область Отчеты

// Определяет список команд отчетов.
//
// Параметры:
//   КомандыОтчетов - См. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.КомандыОтчетов
//   Параметры - См. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.Параметры
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры) Экспорт
	
	
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Организация") 
		И Параметры.Свойство("Отбор")
		И Параметры.Отбор.Свойство("Владелец") Тогда
		
		СтандартнаяОбработка = Ложь;
		ДанныеВыбора = Новый СписокЗначений();
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкиФормированияПроводок.Ссылка КАК Ссылка,
		|	МАКСИМУМ(ЕСТЬNULL(ПланыСчетовОрганизаций.Период, &ПустаяДата)) КАК ПериодПрименения
		|ПОМЕСТИТЬ ВтНастройкиФормированияПроводок
		|ИЗ
		|	Справочник.НастройкиФормированияПроводокМеждународногоУчета КАК НастройкиФормированияПроводок
		|	ЛЕВОЕ СОЕДИНЕНИЕ
		|		РегистрСведений.ПланыСчетовМеждународногоУчетаОрганизаций КАК ПланыСчетовОрганизаций
		|	ПО
		|		ПланыСчетовОрганизаций.Организация = &Организация
		|		И ПланыСчетовОрганизаций.НастройкаФормированияПроводок = НастройкиФормированияПроводок.Ссылка
		|ГДЕ
		|	НЕ НастройкиФормированияПроводок.ПометкаУдаления
		|	И НастройкиФормированияПроводок.Владелец = &ПланСчетов
		|
		|СГРУППИРОВАТЬ ПО
		|	Ссылка
		|;
		|
		|ВЫБРАТЬ
		|	НастройкиФормированияПроводок.Ссылка КАК Ссылка,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(НастройкиФормированияПроводок.Ссылка) КАК Представление,
		|	НастройкиФормированияПроводок.ПериодПрименения КАК ПериодПрименения
		|ИЗ
		|	ВтНастройкиФормированияПроводок КАК НастройкиФормированияПроводок
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПериодПрименения УБЫВ
		|";
		Запрос.УстановитьПараметр("Организация", Параметры.Организация);
		Запрос.УстановитьПараметр("ПланСчетов", Параметры.Отбор.Владелец);
		Запрос.УстановитьПараметр("ПустаяДата", Дата(1,1,1));
		Выборка = Запрос.Выполнить().Выбрать();
		Индекс = 0;
		Пока Выборка.Следующий() Цикл
			
			Если Не ЗначениеЗаполнено(Выборка.ПериодПрименения) Тогда
				Представление = Выборка.Представление;
			ИначеЕсли Индекс = 0 Тогда
				Представление = СтрШаблон(НСтр("ru = '%1 (применяется с %2)';
												|en = '%1 (applied since %2)'"), 
					Выборка.Представление, Формат(Выборка.ПериодПрименения, "ДЛФ=D"));
			Иначе
				Представление = СтрШаблон(НСтр("ru = '%1 (применялась с %2)';
												|en = '%1 (has been applied since %2)'"), 
					Выборка.Представление, Формат(Выборка.ПериодПрименения, "ДЛФ=D"));
			КонецЕсли;
			ДанныеВыбора.Добавить(Выборка.Ссылка, Представление);
			Индекс = Индекс + 1;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает структуру настроек формирования проводок. Если передан элемент справочника настроек, структура заполняется
// значениями реквизитов переданного элемента. Если параметр ЗаполнитьПоВсем имеет значение Истина, выполняется попытка 
// заполнения свойств структуры значениями соответствующих реквизитов, одинаковых во всех элементах справочника.
// 
// Параметры:
//  НастройкаФормированияПроводок - СправочникСсылка.НастройкиФормированияПроводокМеждународногоУчета - элемент справочника настроек
//  ЗаполнитьПоВсем - Булево - Определяет необходимость заполнения свойств значениями реквизитов, одинаковых во всех элементах справочника
//
// Возвращаемое значение:
//  Структура - Содержит ключи:
//   * ВариантФормированияПроводок - Неопределено, ПеречислениеСсылка.ВариантыФормированияПроводок - 
//   * СпособУчетаНесобственныхЦенностей - Неопределено, ПеречислениеСсылка.СпособыУчетаНесобственныхПодконтрольныхЦенностей - 
//   * СпособАннулированияПроводок - Неопределено, ПеречислениеСсылка.СпособыАннулированияПроводокМеждународногоУчета - 
//   * ВыделениеДолгосрочныхАктивовОбязательств - Неопределено, Булево - 
//   * ВыручкаБезНДС - Неопределено, Булево -
//   * ЗакрытиеСчетовДоходовИРасходов - Неопределено, ПеречислениеСсылка.ЗакрытиеСчетовДоходовИРасходов - 
//
Функция НастройкиФормированияПроводок(НастройкаФормированияПроводок = Неопределено, ЗаполнитьПоВсем = Истина) Экспорт
	
	НастройкиПроводок = Новый Структура();
	НастройкиПроводок.Вставить("ВариантФормированияПроводок", Неопределено);
	НастройкиПроводок.Вставить("СпособУчетаНесобственныхЦенностей", Неопределено);
	НастройкиПроводок.Вставить("СпособАннулированияПроводок", Неопределено);
	НастройкиПроводок.Вставить("ВыделениеДолгосрочныхАктивовОбязательств", Неопределено);
	НастройкиПроводок.Вставить("ВыручкаБезНДС", Неопределено);
	НастройкиПроводок.Вставить("ЗакрытиеСчетовДоходовИРасходов", Неопределено);
	
	Если ЗначениеЗаполнено(НастройкаФормированияПроводок) Тогда
		НастройкиПроводок.ВариантФормированияПроводок = "Владелец.ВариантФормированияПроводок";
		НастройкиПроводок.СпособУчетаНесобственныхЦенностей = "Владелец.СпособУчетаНесобственныхПодконтрольныхЦенностей";
		НастройкиПроводок.СпособАннулированияПроводок = "СпособАннулированияПроводок";
		НастройкиПроводок.ВыделениеДолгосрочныхАктивовОбязательств = "ИспользоватьВыделениеДолгосрочныхАктивовОбязательств";
		НастройкиПроводок.ВыручкаБезНДС = "ПроводкиПоВыручкеБезНДС";
		НастройкиПроводок.ЗакрытиеСчетовДоходовИРасходов = "ЗакрытиеСчетовДоходовИРасходов";
		
		НастройкиПроводок = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
			НастройкаФормированияПроводок, НастройкиПроводок);
	ИначеЕсли ЗаполнитьПоВсем Тогда
		ТекстЗапроса = "
		|ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ НастройкиФормированияПроводок.Владелец.ВариантФормированияПроводок) КАК КоличествоВариантФормированияПроводок,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ НастройкиФормированияПроводок.Владелец.СпособУчетаНесобственныхПодконтрольныхЦенностей) КАК КоличествоСпособУчетаНесобственныхЦенностей,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ НастройкиФормированияПроводок.СпособАннулированияПроводок) КАК КоличествоСпособАннулированияПроводок,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ НастройкиФормированияПроводок.ИспользоватьВыделениеДолгосрочныхАктивовОбязательств) КАК КоличествоВыделениеДолгосрочныхАктивовОбязательств,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ НастройкиФормированияПроводок.ПроводкиПоВыручкеБезНДС) КАК КоличествоВыручкаБезНДС,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ НастройкиФормированияПроводок.ЗакрытиеСчетовДоходовИРасходов) КАК КоличествоЗакрытиеСчетовДоходовИРасходов,
		|	МАКСИМУМ(НастройкиФормированияПроводок.Владелец.ВариантФормированияПроводок) КАК ВариантФормированияПроводок,
		|	МАКСИМУМ(НастройкиФормированияПроводок.Владелец.СпособУчетаНесобственныхПодконтрольныхЦенностей) КАК СпособУчетаНесобственныхЦенностей,
		|	МАКСИМУМ(НастройкиФормированияПроводок.СпособАннулированияПроводок) КАК СпособАннулированияПроводок,
		|	МАКСИМУМ(НастройкиФормированияПроводок.ИспользоватьВыделениеДолгосрочныхАктивовОбязательств) КАК ВыделениеДолгосрочныхАктивовОбязательств,
		|	МАКСИМУМ(НастройкиФормированияПроводок.ПроводкиПоВыручкеБезНДС) КАК ВыручкаБезНДС,
		|	МАКСИМУМ(НастройкиФормированияПроводок.ЗакрытиеСчетовДоходовИРасходов) КАК ЗакрытиеСчетовДоходовИРасходов
		|ИЗ
		|	Справочник.НастройкиФормированияПроводокМеждународногоУчета КАК НастройкиФормированияПроводок
		|ГДЕ
		|	НЕ НастройкиФормированияПроводок.ПометкаУдаления
		|";
		Запрос = Новый Запрос(ТекстЗапроса);
		Результат = Запрос.Выполнить();
		
		Если НЕ Результат.Пустой() Тогда
			Выборка = Результат.Выбрать();
			Выборка.Следующий();
			Если Выборка.КоличествоВариантФормированияПроводок = 1 Тогда
				НастройкиПроводок.ВариантФормированияПроводок = Выборка.ВариантФормированияПроводок;
			КонецЕсли;
			Если Выборка.КоличествоСпособУчетаНесобственныхЦенностей = 1 Тогда
				НастройкиПроводок.СпособУчетаНесобственныхЦенностей = Выборка.СпособУчетаНесобственныхЦенностей;
			КонецЕсли;
			Если Выборка.КоличествоСпособАннулированияПроводок = 1 Тогда
				НастройкиПроводок.СпособАннулированияПроводок = Выборка.СпособАннулированияПроводок;
			КонецЕсли;
			Если Выборка.КоличествоВыделениеДолгосрочныхАктивовОбязательств = 1 Тогда
				НастройкиПроводок.ВыделениеДолгосрочныхАктивовОбязательств = Выборка.ВыделениеДолгосрочныхАктивовОбязательств;
			КонецЕсли;
			Если Выборка.КоличествоВыручкаБезНДС = 1 Тогда
				НастройкиПроводок.ВыручкаБезНДС = Выборка.ВыручкаБезНДС;
			КонецЕсли;
			Если Выборка.КоличествоЗакрытиеСчетовДоходовИРасходов = 1 Тогда
				НастройкиПроводок.ЗакрытиеСчетовДоходовИРасходов = Выборка.ЗакрытиеСчетовДоходовИРасходов;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат НастройкиПроводок;
	
КонецФункции

// Настройка формирования проводок используется.
// 
// Параметры:
//  НастройкаФормированияПроводок - СправочникСсылка.НастройкиФормированияПроводокМеждународногоУчета -  Настройка формирования проводок
// 
// Возвращаемое значение:
//  Булево - Настройка формирования проводок используется
Функция НастройкаФормированияПроводокИспользуется(НастройкаФормированияПроводок) Экспорт
	
	Если НЕ ЗначениеЗаполнено(НастройкаФормированияПроводок) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("НастройкаФормированияПроводок", НастройкаФормированияПроводок);
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ПланыСчетовОрганизаций.ПланСчетов КАК ПланСчетов,
	|	ПланыСчетовОрганизаций.Организация КАК Организация,
	|	ПланыСчетовОрганизаций.Период КАК НачалоПериода,
	|	ЕСТЬNULL(МИНИМУМ(ПериодыОкончанияДействияНастроек.Период), &ТекущаяДата) КАК ОкончаниеПериода
	|ИЗ
	|	РегистрСведений.ПланыСчетовМеждународногоУчетаОрганизаций КАК ПланыСчетовОрганизаций
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПланыСчетовМеждународногоУчетаОрганизаций КАК ПериодыОкончанияДействияНастроек
	|		ПО ПланыСчетовОрганизаций.ПланСчетов = ПериодыОкончанияДействияНастроек.ПланСчетов
	|		 И ПланыСчетовОрганизаций.Организация = ПериодыОкончанияДействияНастроек.Организация
	|		 И ПланыСчетовОрганизаций.Период < ПериодыОкончанияДействияНастроек.Период
	|ГДЕ
	|	ПланыСчетовОрганизаций.НастройкаФормированияПроводок = &НастройкаФормированияПроводок
	|СГРУППИРОВАТЬ ПО
	|	ПланыСчетовОрганизаций.ПланСчетов,
	|	ПланыСчетовОрганизаций.Организация,
	|	ПланыСчетовОрганизаций.Период
	|";
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат Ложь;
	КонецЕсли;

	ТекстЗапросаПроводок = "
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИСТИНА
	|ИЗ
	|	РегистрБухгалтерии.Международный КАК Международный
	|ГДЕ
	|	Международный.Период МЕЖДУ &НачалоПериода77 И &ОкончаниеПериода77
	|	И Международный.ПланСчетов = &ПланСчетов77
	|	И Международный.Организация = &Организация77
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИСТИНА
	|ИЗ
	|	РегистрБухгалтерии.МеждународныйБезКорреспонденции КАК Международный
	|ГДЕ
	|	Международный.Период МЕЖДУ &НачалоПериода77 И &ОкончаниеПериода77
	|	И Международный.ПланСчетов = &ПланСчетов77
	|	И Международный.Организация = &Организация77
	|";
	
	Выборка = Результат.Выбрать();
	ТекстыЗапросов = Новый Массив();
	НомерЗапроса = 1;
	
	Пока Выборка.Следующий() Цикл
		ТекстыЗапросов.Добавить(СтрЗаменить(ТекстЗапросаПроводок, "77", НомерЗапроса));
		Запрос.УстановитьПараметр("НачалоПериода" + НомерЗапроса, Выборка.НачалоПериода);
		Запрос.УстановитьПараметр("ОкончаниеПериода" + НомерЗапроса, Выборка.ОкончаниеПериода);
		Запрос.УстановитьПараметр("ПланСчетов" + НомерЗапроса, Выборка.ПланСчетов);
		Запрос.УстановитьПараметр("Организация" + НомерЗапроса, Выборка.Организация);
		НомерЗапроса = НомерЗапроса + 1;
	КонецЦикла;
	
	Запрос.Текст = СтрСоединить(ТекстыЗапросов, ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении());
	Результат = Запрос.Выполнить();
	
	Возврат НЕ Результат.Пустой();
	
КонецФункции

#КонецОбласти

#КонецЕсли
